app/Controllers/Books.php

SELECT *
FROM `books`
WHERE `is_available` = 1
AND `books`.`deleted_at` IS NULL
SELECT *
FROM `categories_books`
WHERE `book_id` = '3'
AND `categories_books`.`deleted_at` IS NULL
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
AND `categories`.`id` = '1'
---
    public function index()
    {
        $result = [];
        $categoriesBooksModel = new CategoryBookModel();
        $categoryModel = new CategoryModel();
        foreach ($this->book->where('is_available', 1)->findAll() as $book) {
            $categoriesRelationship = [];
            foreach ($categoriesBooksModel->where('book_id', $book->id)->findAll() as $categoryBookModel) {
                $category = $categoryModel->find($categoryBookModel->category_id);

SELECT *
FROM `books`
WHERE `books`.`deleted_at` IS NULL
AND `books`.`id` = '1'
SELECT *
FROM `categories_books`
WHERE `book_id` = '1'
AND `categories_books`.`deleted_at` IS NULL
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
AND `categories`.`id` = '1'
---
    public function show($id)
    {
        $result = [];
        $categoriesBooksModel = new CategoryBookModel();
        $categoryModel = new CategoryModel();
        $book = $this->book->find($id);

        $categoriesRelationship = [];
        foreach ($categoriesBooksModel->where('book_id', $book->id)->findAll() as $categoryBookModel) {
            $category = $categoryModel->find($categoryBookModel->category_id);

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
AND `categories`.`id` = '1'
---

        $categoryModel = new CategoryModel();
        foreach (request()->getJson()->categories as $category) {
            if ($categoryModel->find($category) === null) {

INSERT INTO `books` (`name`, `author`, `created_at`, `updated_at`) VALUES ('La roca', 'Sebastian', '2024-03-09 08:40:04', '2024-03-09 08:40:04')
---
            }
        }

        $bookId = $this->book->insert(request()->getJson());