app/Controllers/Categories.php

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
---
    public function index()
    {
        return $this->response->setStatusCode(200)->setJSON($this->category->findAll());