app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `users_books`
WHERE `user_id` = '2'
AND `users_books`.`deleted_at` IS NULL
SELECT *
FROM `books`
WHERE `books`.`deleted_at` IS NULL
AND `books`.`id` = '3'
---
    public function index()
    {
        $result = [];
        $bookModel = new BookModel();
        $usersBooksModel = new UserBookModel();
        foreach ($this->user->findAll() as $user) {
            $booksRelationship = [];
            foreach ($usersBooksModel->where('user_id', $user->id)->findAll() as $userBookModel) {
                $book = $bookModel->find($userBookModel->book_id);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '2'
SELECT *
FROM `users_books`
WHERE `user_id` = '2'
AND `users_books`.`deleted_at` IS NULL
SELECT *
FROM `books`
WHERE `books`.`deleted_at` IS NULL
AND `books`.`id` = '4'
---
    public function show($id)
    {
        $result = [];
        $bookModel = new BookModel();
        $usersBooksModel = new UserBookModel();
        $user = $this->user->find($id);
        $result = [];
        $booksRelationship = [];
        foreach ($usersBooksModel->where('user_id', $user->id)->findAll() as $userBookModel) {
            $book = $bookModel->find($userBookModel->book_id);

UPDATE `users` SET `deleted_at` = '2024-03-09 08:25:51', `updated_at` = '2024-03-09 08:25:51'
WHERE `id` IN ('6')
AND `deleted_at` IS NULL
---
    public function update($id)
    {
        $rules = [
            'name' => [
                'label' => 'nombre',
                'rules' => 'required|min_length[5]|max_length[150]|regex_match[/^([a-zA-Z ])+$/]',
                'errors' => [
                    'required' => 'El {field} es obligatorio.',
                    'min_length' => 'El {field} es debe tener minimo 5 letras.',
                    'max_length' => 'El {field} es debe tener máximo 150 caracteres.',
                    'regex_match' => 'El {field} debe ser texto.'
                ],
            ],
            'email' => [
                'label' => 'correo electrónico',
                'rules' => 'required|valid_email|is_unique[users.email,id,{id}]',
                'errors' => [
                    'required' => 'El {field} es obligatorio.',
                    'valid_email' => 'El {field} debe ser válido.',
                    'is_unique' => 'El {field} ya existe.'
                ],
            ]
        ];

        if (!$this->validate($rules)) {
            return $this->response->setStatusCode(409)->setJSON(["message" => $this->validator->getErrors()]);
        }

        $this->user->update($id, request()->getJson());